Microchip-MPLAB-Harmony/smartenergy_metrology/apps/muti_channel_demo_freertos/src/config/multichannel_demo_pic32cxmtc_db/driver/mcmetrology/drv_mcmetrology_regs.h
/*
Copyright (C) 2025, Microchip Technology Inc., and its subsidiaries. All rights reserved.

The software and documentation is provided by microchip and its contributors
"as is" and any express, implied or statutory warranties, including, but not
limited to, the implied warranties of merchantability, fitness for a particular
purpose and non-infringement of third party intellectual property rights are
disclaimed to the fullest extent permitted by law. In no event shall microchip
or its contributors be liable for any direct, indirect, incidental, special,
exemplary, or consequential damages (including, but not limited to, procurement
of substitute goods or services; loss of use, data, or profits; or business
interruption) however caused and on any theory of liability, whether in contract,
strict liability, or tort (including negligence or otherwise) arising in any way
out of the use of the software and documentation, even if advised of the
possibility of such damage.

Except as expressly permitted hereunder and subject to the applicable license terms
for any third-party software incorporated in the software and any applicable open
source software license terms, no license or other rights, whether express or
implied, are granted under any patent or other intellectual property rights of
Microchip or any third party.
*/

#ifndef MCMMETROLOGY_REGS_H
#define MCMMETROLOGY_REGS_H

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR METROLOGY REGISTERS                          */
/* ************************************************************************** */
/* MISRA C-2012 deviation block start */
/* MISRA C-2012 Rule 5.4 deviated 64 times.  Deviation record ID - H3_MISRAC_2012_R_5_4_DR_1 */

/* -------- STATE_CTRL : (MET_CONTROL) (R/W 32) Metrology state control register -------- */
#define STATE_CTRL_STATE_CTRL_Pos                             _UINT32_(0)                               /* (STATE_CTRL) State Control Position */
#define STATE_CTRL_STATE_CTRL_Msk                             (_UINT32_(0xF) << STATE_CTRL_STATE_CTRL_Pos)         /* (STATE_CTRL) State Control Mask */
#define STATE_CTRL_STATE_CTRL(value)                          (STATE_CTRL_STATE_CTRL_Msk & (_UINT32_(value) << STATE_CTRL_STATE_CTRL_Pos))
#define   STATE_CTRL_STATE_CTRL_RESET_Val                       _UINT32_(0x0)                           /* (STATE_CTRL) Reset metrology module, reset ATSENSE and halt metrology filters.  */
#define   STATE_CTRL_STATE_CTRL_INIT_Val                        _UINT32_(0x1)                           /* (STATE_CTRL) Input control registers are initialized and metrology can initialize itself.  */
#define   STATE_CTRL_STATE_CTRL_RUN_Val                         _UINT32_(0x2)                           /* (STATE_CTRL) Metrology filters are free to run, and outputs are updated at commanded rate.  */

/* -------- FEATURE_CTRL0 : (MET_CONTROL) (R/W 32) Metrology feature setting register 0 -------- */
#define FEATURE_CTRL0_SYNCH_Pos                               _UINT32_(0)                               /* (FEATURE_CTRL) Active Voltage Channel Selection Position */
#define FEATURE_CTRL0_SYNCH_Msk                               (_UINT32_(0x7F) << FEATURE_CTRL_SYNCH_Pos)    /* (FEATURE_CTRL) Active Voltage Channel Selection Mask */
#define FEATURE_CTRL0_SYNCH(value)                            (FEATURE_CTRL_SYNCH_Msk & (_UINT32_(value) << FEATURE_CTRL_SYNCH_Pos))
#define   FEATURE_CTRL0_SYNCH_ACTIVE_CH                         _UINT32_(0x0)                           /* (FEATURE_CTRL) Measurement interval based on active channel, determined dynamically */
#define FEATURE_CTRL0_RZC_THRESH_DIS_EN_Pos                   _UINT32_(7)                               /* (FEATURE_CTRL) Enable Phase A Position */
#define FEATURE_CTRL0_RZC_THRESH_DIS_EN_Msk                   (_UINT32_(0x1) << FEATURE_CTRL_RZC_THRESH_DIS_EN_Pos)    /* (FEATURE_CTRL) Enable Phase A Mask */
#define FEATURE_CTRL0_RZC_THRESH_DIS_EN(value)                (FEATURE_CTRL_RZC_THRESH_DIS_EN_Msk & (_UINT32_(value) << FEATURE_CTRL_RZC_THRESH_DIS_EN_Pos))
#define   FEATURE_CTRL0_RZC_THRESH_DIS_EN_DISABLED_Val          _UINT32_(0x0)                           /* (FEATURE_CTRL) Threshold set to the average value computed in the last integration period */
#define   FEATURE_CTRL0_RZC_THRESH_DIS_EN_ENABLED_Val           _UINT32_(0x1)                           /* (FEATURE_CTRL) Threshold set to 0 */
#define FEATURE_CTRL0_POWER_NUMBER_Pos                        _UINT32_(8)                               /* (FEATURE_CTRL) Number of powers computed Position */
#define FEATURE_CTRL0_POWER_NUMBER_Msk                        (_UINT32_(0x1F) << FEATURE_CTRL_POWER_NUMBER_Pos)    /* (FEATURE_CTRL) Number of powers computed Mask */
#define FEATURE_CTRL0_POWER_NUMBER(value)                     (FEATURE_CTRL_POWER_NUMBER_Msk & (_UINT32_(value) << FEATURE_CTRL_POWER_NUMBER_Pos))
#define FEATURE_CTRL0_MAX_INT_SELECT_Pos                      _UINT32_(15)                               /* (FEATURE_CTRL) Max Integration Period Select Position */
#define FEATURE_CTRL0_MAX_INT_SELECT_Msk                      (_UINT32_(0x1) << FEATURE_CTRL_MAX_INT_SELECT_Pos)    /* (FEATURE_CTRL) Max Integration Period Select A Mask */
#define FEATURE_CTRL0_MAX_INT_SELECT(value)                   (FEATURE_CTRL_MAX_INT_SELECT_Msk & (_UINT32_(value) << FEATURE_CTRL_MAX_INT_SELECT_Pos))
#define   FEATURE_CTRL0_MAX_INT_SELECT_1S_Val                   _UINT32_(0x0)                           /* (FEATURE_CTRL) Metrology DSP will integrate for an integral number of cycles closest to 1 second */
#define   FEATURE_CTRL0_MAX_INT_SELECT_LESS1S_Val               _UINT32_(0x1)                           /* (FEATURE_CTRL) Metrology DSP will integrate for an integral number of cycles no greater than 1 second */
#define FEATURE_CTRL0_RZC_CHAN_SELECT_Pos                     _UINT32_(16)                               /* (FEATURE_CTRL) Raw Zero-Crossing Channel Select and Enable Position */
#define FEATURE_CTRL0_RZC_CHAN_SELECT_Msk                     (_UINT32_(0x7F) << FEATURE_CTRL_RZC_CHAN_SELECT_Pos)    /* (FEATURE_CTRL) Raw Zero-Crossing Channel Select and Enable Mask */
#define FEATURE_CTRL0_RZC_CHAN_SELECT(value)                  (FEATURE_CTRL_RZC_CHAN_SELECT_Msk & (_UINT32_(value) << FEATURE_CTRL_RZC_CHAN_SELECT_Pos))
#define   FEATURE_CTRL0_RZC_CHAN_SELECT_DISABLED_Val            _UINT32_(0x0)                           /* (FEATURE_CTRL) Raw Zero-Crossing detection is disabled */
#define FEATURE_CTRL0_RZC_DIR_Pos                             _UINT32_(23)                               /* (FEATURE_CTRL) Raw Zero-Crossing Direction Selection Position */
#define FEATURE_CTRL0_RZC_DIR_Msk                             (_UINT32_(0x1) << FEATURE_CTRL_RZC_DIR_Pos)    /* (FEATURE_CTRL) Raw Zero-Crossing Direction Selection Mask */
#define FEATURE_CTRL0_RZC_DIR(value)                          (FEATURE_CTRL_RZC_DIR_Msk & (_UINT32_(value) << FEATURE_CTRL_RZC_DIR_Pos))
#define   FEATURE_CTRL0_RZC_RZC_DIR_POSITIVE_Val                _UINT32_(0x0)                           /* (FEATURE_CTRL) Positive-going raw zero-crossings selected */
#define   FEATURE_CTRL0_RZC_RZC_DIR_NEGATIVE_Val                _UINT32_(0x1)                           /* (FEATURE_CTRL) Negative-going raw zero-crossings selected */
#define FEATURE_CTRL_AFE_SELECTION_Pos                        _UINT32_(28)                               /* (FEATURE_CTRL) AFE Selection Position */
#define FEATURE_CTRL_AFE_SELECTION_Msk                        (_UINT32_(0xF) << FEATURE_CTRL_AFE_SELECTION_Pos)    /* (FEATURE_CTRL) AFE Selection Mask */
#define FEATURE_CTRL_AFE_SELECTION(value)                     (FEATURE_CTRL_AFE_SELECTION_Msk & (_UINT32_(value) << FEATURE_CTRL_AFE_SELECTION_Pos))
#define   FEATURE_CTRL_AFE_SELECTION_1_MCP3914                  _UINT32_(0x0)                           /* (FEATURE_CTRL) 8 channels and up to 7 powers are allowed. Not tested */
#define   FEATURE_CTRL_AFE_SELECTION_2_MCP3914                  _UINT32_(0x1)                           /* (FEATURE_CTRL) 16 channels and up to 15 powers are allowed. Not tested */
#define   FEATURE_CTRL_AFE_SELECTION_3_MCP3914                  _UINT32_(0x2)                           /* (FEATURE_CTRL) 24 channels and up to 23 powers are allowed. Not supported in this version */
#define   FEATURE_CTRL_AFE_SELECTION_4_MCP3914                  _UINT32_(0x3)                           /* (FEATURE_CTRL) 32 channels and up to 31 powers are allowed. Not supported in this version */
#define   FEATURE_CTRL_AFE_SELECTION_1_MCP3913                  _UINT32_(0x4)                           /* (FEATURE_CTRL) 6 channels and up to 5 powers are allowed */
#define   FEATURE_CTRL_AFE_SELECTION_2_MCP3913                  _UINT32_(0x5)                           /* (FEATURE_CTRL) 12 channels and up to 11 powers are allowed */
#define   FEATURE_CTRL_AFE_SELECTION_3_MCP3913                  _UINT32_(0x6)                           /* (FEATURE_CTRL) 18 channels and up to 17 powers are allowed. Not supported in this version */
#define   FEATURE_CTRL_AFE_SELECTION_4_MCP3913                  _UINT32_(0x7)                           /* (FEATURE_CTRL) 24 channels and up to 23 powers are allowed. Not supported in this version */

