Microchip-MPLAB-Harmony/smartenergy_metrology/apps/muti_channel_demo_freertos/src/config/multichannel_demo_pic32cxmtc_db/driver/mcmetrology/drv_mcmetrology_regs.h
/* -------- FEATURE_CTRL1 : (MET_CONTROL) (R/W 32) Metrology feature setting register 1 -------- */
#define FEATURE_CTRL1_CREEP_I_EN_Pos             _UINT32_(0)                                 /* (FEATURE_CTRL1) Current Creep Threshold Function Enable Position */
#define FEATURE_CTRL1_CREEP_I_EN_Msk             (_UINT32_(0x1) << FEATURE_CTRL1_CREEP_I_EN_Pos)    /* (FEATURE_CTRL1) Current Creep Threshold Function Enable Mask */
#define FEATURE_CTRL1_CREEP_I_EN(value)          (FEATURE_CTRL1_CREEP_I_EN_Msk & (_UINT32_(value) << FEATURE_CTRL1_CREEP_I_EN_Pos))
#define   FEATURE_CTRL1_CREEP_I_EN_DISABLED_Val    _UINT32_(0x0)                             /* (FEATURE_CTRL1) Disable current creep threshold feature */
#define   FEATURE_CTRL1_CREEP_I_EN_ENABLED_Val     _UINT32_(0x1)                             /* (FEATURE_CTRL1) Enable current creep threshold feature */
#define FEATURE_CTRL1_CREEP_Q_EN_Pos             _UINT32_(1)                                 /* (FEATURE_CTRL1) Reactive Creep Threshold Function Enable Position */
#define FEATURE_CTRL1_CREEP_Q_EN_Msk             (_UINT32_(0x1) << FEATURE_CTRL1_CREEP_Q_EN_Pos)    /* (FEATURE_CTRL1) Reactive Creep Threshold Function Enable Mask */
#define FEATURE_CTRL1_CREEP_Q_EN(value)          (FEATURE_CTRL1_CREEP_Q_EN_Msk & (_UINT32_(value) << FEATURE_CTRL1_CREEP_Q_EN_Pos))
#define   FEATURE_CTRL1_CREEP_Q_EN_DISABLED_Val    _UINT32_(0x0)                             /* (FEATURE_CTRL1) Disable Reactive creep threshold feature */
#define   FEATURE_CTRL1_CREEP_Q_EN_ENABLED_Val     _UINT32_(0x1)                             /* (FEATURE_CTRL1) Enable Reactive creep threshold feature */
#define FEATURE_CTRL1_CREEP_P_EN_Pos             _UINT32_(2)                                 /* (FEATURE_CTRL1) Active Creep Threshold Function Enable Position */
#define FEATURE_CTRL1_CREEP_P_EN_Msk             (_UINT32_(0x1) << FEATURE_CTRL1_CREEP_P_EN_Pos)    /* (FEATURE_CTRL1) Active Creep Threshold Function Enable Mask */
#define FEATURE_CTRL1_CREEP_P_EN(value)          (FEATURE_CTRL1_CREEP_P_EN_Msk & (_UINT32_(value) << FEATURE_CTRL1_CREEP_P_EN_Pos))
#define   FEATURE_CTRL1_CREEP_P_EN_DISABLED_Val    _UINT32_(0x0)                             /* (FEATURE_CTRL1) Disable Active creep threshold feature */
#define   FEATURE_CTRL1_CREEP_P_EN_ENABLED_Val     _UINT32_(0x1)                             /* (FEATURE_CTRL1) Enable Active creep threshold feature */
#define FEATURE_CTRL1_HARMONIC_m_REQ_Pos            _UINT32_(8)                              /* (FEATURE_CTRL1) Request number of harmonic for analysis Position */
#define FEATURE_CTRL1_HARMONIC_m_REQ_Msk            (_UINT32_(0x3F) << FEATURE_CTRL1_HARMONIC_m_REQ_Pos)    /* (FEATURE_CTRL1) Request number of harmonic for analysis Mask */
#define FEATURE_CTRL1_HARMONIC_m_REQ(value)         (FEATURE_CTRL1_HARMONIC_m_REQ_Msk & (_UINT32_(value) << FEATURE_CTRL1_HARMONIC_m_REQ_Pos))
#define FEATURE_CTRL1_HARMONIC_EN_Pos            _UINT32_(15)                                /* (FEATURE_CTRL1) Enable Harmonic Analysis Position */
#define FEATURE_CTRL1_HARMONIC_EN_Msk            (_UINT32_(0x1) << FEATURE_CTRL1_HARMONIC_EN_Pos)    /* (FEATURE_CTRL1) Enable Harmonic Analysis Mask */
#define FEATURE_CTRL1_HARMONIC_EN(value)         (FEATURE_CTRL1_HARMONIC_EN_Msk & (_UINT32_(value) << FEATURE_CTRL1_HARMONIC_EN_Pos))
#define   FEATURE_CTRL1_HARMONIC_EN_DISABLED_Val   _UINT32_(0x0)                             /* (FEATURE_CTRL1) Disable harmonic analysis  */
#define   FEATURE_CTRL1_HARMONIC_EN_ENABLED_Val    _UINT32_(0x1)                             /* (FEATURE_CTRL1) Enable harmonic analysis  */
#define FEATURE_CTRL1_I_MAX_RESET_Pos            _UINT32_(19)                                /* (FEATURE_CTRL1) Reset All I_x_MAX values Position */
#define FEATURE_CTRL1_I_MAX_RESET_Msk            (_UINT32_(0x1) << FEATURE_CTRL1_I_MAX_RESET_Pos)    /* (FEATURE_CTRL1) Reset All I_x_MAX values Mask */
#define FEATURE_CTRL1_I_MAX_RESET(value)         (FEATURE_CTRL1_I_MAX_RESET_Msk & (_UINT32_(value) << FEATURE_CTRL1_I_MAX_RESET_Pos))
#define FEATURE_CTRL1_V_MAX_RESET_Pos            _UINT32_(23)                                /* (FEATURE_CTRL1) Reset All V_x_MAX values Position */
#define FEATURE_CTRL1_V_MAX_RESET_Msk            (_UINT32_(0x1) << FEATURE_CTRL1_V_MAX_RESET_Pos)    /* (FEATURE_CTRL1) Reset All V_x_MAX values Mask */
#define FEATURE_CTRL1_V_MAX_RESET(value)         (FEATURE_CTRL1_V_MAX_RESET_Msk & (_UINT32_(value) << FEATURE_CTRL1_V_MAX_RESET_Pos))

/* -------- POWER_SOURCE : (MET_CONTROL) (R/W 32) Metrology power source -------- */
#define POWER_SOURCE_PH_a_V_SOURCE_Pos            _UINT32_(0)                                /* (POWER_SOURCE) Selects the PH A channels with the voltage source of each power Position */
#define POWER_SOURCE_PH_a_V_SOURCE_Msk            (_UINT32_(0x1F) << POWER_SOURCE_PH_a_V_SOURCE_Pos)    /* (POWER_SOURCE) Selects the PH A channels with the voltage source of each power Mask */
#define POWER_SOURCE_PH_a_V_SOURCE(value)         (POWER_SOURCE_PH_a_V_SOURCE_Msk & (_UINT32_(value) << POWER_SOURCE_PH_a_V_SOURCE_Pos))
#define POWER_SOURCE_PH_a_I_SOURCE_Pos            _UINT32_(8)                                /* (POWER_SOURCE) Selects the PH A channels with the current source of each power Position */
#define POWER_SOURCE_PH_a_I_SOURCE_Msk            (_UINT32_(0x1F) << POWER_SOURCE_PH_a_I_SOURCE_Pos)    /* (POWER_SOURCE) Selects the PH A channels with the current source of each power Mask */
#define POWER_SOURCE_PH_a_I_SOURCE(value)         (POWER_SOURCE_PH_a_I_SOURCE_Msk & (_UINT32_(value) << POWER_SOURCE_PH_a_I_SOURCE_Pos))
#define POWER_SOURCE_PH_b_V_SOURCE_Pos            _UINT32_(16)                                /* (POWER_SOURCE) Selects the PH B channels with the voltage source of each power Position */
#define POWER_SOURCE_PH_b_V_SOURCE_Msk            (_UINT32_(0x1F) << POWER_SOURCE_PH_b_V_SOURCE_Pos)    /* (POWER_SOURCE) Selects the PH B channels with the voltage source of each power Mask */
#define POWER_SOURCE_PH_b_V_SOURCE(value)         (POWER_SOURCE_PH_b_V_SOURCE_Msk & (_UINT32_(value) << POWER_SOURCE_PH_b_V_SOURCE_Msk))
#define POWER_SOURCE_PH_b_I_SOURCE_Pos            _UINT32_(24)                                /* (POWER_SOURCE) Selects the PH B channels with the current source of each power Position */
#define POWER_SOURCE_PH_b_I_SOURCE_Msk            (_UINT32_(0x1F) << POWER_SOURCE_PH_b_I_SOURCE_Pos)    /* (POWER_SOURCE) Selects the PH B channels with the current source of each power Mask */
#define POWER_SOURCE_PH_b_I_SOURCE(value)         (POWER_SOURCE_PH_b_I_SOURCE_Msk & (_UINT32_(value) << POWER_SOURCE_PH_b_I_SOURCE_Pos))

/* -------- SENSOR_TYPE : (MET_CONTROL) (R/W 32) Channel type and Sensor Configuration Register -------- */
#define SENSOR_TYPE_CHx_Pos                       _UINT32_(0)                               /* (SENSOR_TYPE) Current Sensor Type on A Phase Position */
#define SENSOR_TYPE_CHx_Msk                       (_UINT32_(0x3) << SENSOR_TYPE_CHx_Pos)    /* (SENSOR_TYPE) Current Sensor Type on A Phase Mask */
#define SENSOR_TYPE_CHx(channel, value)           ((SENSOR_TYPE_CHx_Msk & (_UINT32_(value) << SENSOR_TYPE_CHx_Pos)) << (1 << channel))
#define   SENSOR_TYPE_CHx_CT_Val                    _UINT32_(0x0)                             /* (SENSOR_TYPE) Current Transformer */
#define   SENSOR_TYPE_CHx_SHUNT_Val                 _UINT32_(0x1)                             /* (SENSOR_TYPE) Resistive Shunt */
#define   SENSOR_TYPE_CHx_CRC_Val                   _UINT32_(0x2)                             /* (SENSOR_TYPE) Rogowski Coil (CRC) current sensor */
#define   SENSOR_TYPE_CHx_VRD_Val                   _UINT32_(0x3)                             /* (SENSOR_TYPE) Resistive Divider (VRD) voltage sensor */

/* -------- PULSEx_CTRL : (MET_CONTROL) (R/W 32) Pulse 0 control: enable/disable, polarity, quantity type selection -------- */
#define PULSEx_CTRL_PCx_WIDTH_Pos                  _UINT32_(0)                                 /* (PULSEx_CTRL) Pulse Width  */
#define PULSEx_CTRL_PCx_WIDTH_Msk                  (_UINT32_(0xFFFF) << PULSEx_CTRL_PCx_WIDTH_Pos)      /* (PULSEx_CTRL) Pulse Width  */
#define PULSEx_CTRL_PCx_WIDTH(value)               (PULSEx_CTRL_PCx_WIDTH_Msk & (_UINT32_(value) << PULSEx_CTRL_PCx_WIDTH_Pos))
#define PULSEx_CTRL_PCx_TYPE_Pos                  _UINT32_(16)                                 /* (PULSEx_CTRL) Pulse Type Selection Position */
#define PULSEx_CTRL_PCx_TYPE_Msk                  (_UINT32_(0xF) << PULSEx_CTRL_PCx_TYPE_Pos)      /* (PULSEx_CTRL) Pulse Type Selection Mask */
#define PULSEx_CTRL_PCx_TYPE(value)               (PULSEx_CTRL_PCx_TYPE_Msk & (_UINT32_(value) << PULSEx_CTRL_PCx_TYPE_Pos))
#define   PULSEx_CTRL_PCx_TYPE_P_T_Val              _UINT32_(0x0)                             /* (PULSEx_CTRL) Watt-hours, total all phases, fundamental + harmonics */
#define   PULSEx_CTRL_PCx_TYPE_P_T_F_Val            _UINT32_(0x1)                             /* (PULSEx_CTRL) Watt-hours, total all phases, fundamental only */
#define   PULSEx_CTRL_PCx_TYPE_Q_T_Val              _UINT32_(0x2)                             /* (PULSEx_CTRL) Var-hours, total all phases, fundamental + harmonics */
#define   PULSEx_CTRL_PCx_TYPE_Q_T_F_Val            _UINT32_(0x3)                             /* (PULSEx_CTRL) Var-hours, total all phases, fundamental only */
#define   PULSEx_CTRL_PCx_TYPE_I_T_Val              _UINT32_(0x4)                             /* (PULSEx_CTRL) Amp-squared-hours, total all phases, fundamental + harmonics */
#define   PULSEx_CTRL_PCx_TYPE_I_T_F_Val            _UINT32_(0x5)                             /* (PULSEx_CTRL) Amp-squared-hours, total all phases, fundamental only */
#define PULSEx_CTRL_PCx_POLARITY_Pos               _UINT32_(24)                                 /* (PULSEx_CTRL) Pulse Polarity Position  */
#define PULSEx_CTRL_PCx_POLARITY_Msk               (_UINT32_(0x1) << PULSEx_CTRL_PCx_POLARITY_Pos)      /* (PULSEx_CTRL) Pulse Polarity Mask  */
#define PULSEx_CTRL_PCx_POLARITY(value)            (PULSEx_CTRL_PCx_POLARITY_Msk & (_UINT32_(value) << PULSEx_CTRL_PCx_POLARITY_Pos))
#define   PULSEx_CTRL_PCx_POLARITY_LOW_Val           _UINT32_(0x0)                             /* (PULSEx_CTRL) Output pulse is low with width set by K_WIDTH, followed by an inactive level of high */
#define   PULSEx_CTRL_PCx_POLARITY_HIGH_Val          _UINT32_(0x1)                             /* (PULSEx_CTRL) Output pulse is high with width set by K_WIDTH, followed by an inactive level of low */
#define PULSEx_CTRL_PCx_OVERRIDE_Pos               _UINT32_(25)                                 /* (PULSEx_CTRL) Pulse Override Control Position  */
#define PULSEx_CTRL_PCx_OVERRIDE_Msk               (_UINT32_(0x1) << PULSEx_CTRL_PCx_OVERRIDE_Pos)      /* (PULSEx_CTRL) Pulse Override Control Mask  */
#define PULSEx_CTRL_PCx_OVERRIDE(value)            (PULSEx_CTRL_PCx_OVERRIDE_Msk & (_UINT32_(value) << PULSEx_CTRL_PCx_OVERRIDE_Pos))
#define   PULSEx_CTRL_PCx_OVERRIDE_ENABLED_Val       _UINT32_(0x0)                             /* (PULSEx_CTRL) Pulse generation functions as normal */
#define   PULSEx_CTRL_PCx_OVERRIDE_DISABLED_Val      _UINT32_(0x1)                             /* (PULSEx_CTRL) Pulse generation is temporarily disabled */
#define PULSEx_CTRL_PCx_ACC_HOLD_Pos               _UINT32_(26)                                 /* (PULSEx_CTRL) Pulse Accumulation Hold Control Position  */
#define PULSEx_CTRL_PCx_ACC_HOLD_Msk               (_UINT32_(0x1) << PULSEx_CTRL_PCx_ACC_HOLD_Pos)      /* (PULSEx_CTRL) Pulse Accumulation Hold Control Mask  */
#define PULSEx_CTRL_PCx_ACC_HOLD(value)            (PULSEx_CTRL_PCx_ACC_HOLD_Msk & (_UINT32_(value) << PULSEx_CTRL_PCx_ACC_HOLD_Pos))
#define   PULSEx_CTRL_PCx_ACC_HOLD_DISABLED_Val      _UINT32_(0x0)                             /* (PULSEx_CTRL) Pulse accumulation registers continue to increment even if pulse generation is temporarily disabled */
#define   PULSEx_CTRL_PCx_ACC_HOLD_ENABLED_Val       _UINT32_(0x1)                             /* (PULSEx_CTRL) Pulse accumulation is held static */
#define PULSEx_CTRL_OPD_ENABLE_Pos                 _UINT32_(27)                                /* (PULSEx_CTRL) Open Drain Enable Position  */
#define PULSEx_CTRL_OPD_ENABLE_Msk                 (_UINT32_(0x1) << PULSEx_CTRL_OPD_ENABLE_Pos)   /* (PULSEx_CTRL) Open Drain Enable Mask  */
#define PULSEx_CTRL_OPD_ENABLE(value)              (PULSEx_CTRL_OPD_ENABLE_Msk & (_UINT32_(value) << PULSEx_CTRL_OPD_ENABLE_Pos))
#define   PULSEx_CTRL_OPD_ENABLE_DISABLED_Val        _UINT32_(0x0)                             /* (PULSEx_CTRL) The open drain is disabled */
#define   PULSEx_CTRL_OPD_ENABLE_ENABLED_Val         _UINT32_(0x1)                             /* (PULSEx_CTRL) The open drain is enabled */
#define PULSEx_CTRL_PCx_DETENT_Pos                 _UINT32_(28)                                /* (PULSEx_CTRL) Total Absolute Values for P and Q values Position  */
#define PULSEx_CTRL_PCx_DETENT_Msk                 (_UINT32_(0x3) << PULSEx_CTRL_PCx_DETENT_Pos)   /* (PULSEx_CTRL) Total Absolute Values for P and Q values Mask  */
#define PULSEx_CTRL_PCx_DETENT(value)              (PULSEx_CTRL_PCx_DETENT_Msk & (_UINT32_(value) << PULSEx_CTRL_PCx_DETENT_Pos))
#define   PULSEx_CTRL_PCx_DETENT_NET_Val             _UINT32_(0x0)                             /* (PULSEx_CTRL) Pulses generated based on (energy delivered ? energy generated) */
#define   PULSEx_CTRL_PCx_DETENT_ABSOLUTE_Val        _UINT32_(0x1)                             /* (PULSEx_CTRL) Pulses generated based on (energy delivered + energy generated) */
#define   PULSEx_CTRL_PCx_DETENT_DELIVERED_Val       _UINT32_(0x2)                             /* (PULSEx_CTRL) Pulses generated based on (energy delivered only) */
#define   PULSEx_CTRL_PCx_DETENT_GENERATED_Val       _UINT32_(0x3)                             /* (PULSEx_CTRL) Pulses generated based on (energy generated only) */
#define PULSEx_CTRL_PU_ENABLE_Pos                  _UINT32_(30)                                /* (PULSEx_CTRL) Pull-Up Enable Position  */
#define PULSEx_CTRL_PU_ENABLE_Msk                  (_UINT32_(0x1) << PULSEx_CTRL_PU_ENABLE_Pos)   /* (PULSEx_CTRL) Pull-Up Enable Mask  */
#define PULSEx_CTRL_PU_ENABLE(value)               (PULSEx_CTRL_PU_ENABLE_Msk & (_UINT32_(value) << PULSEx_CTRL_PU_ENABLE_Pos))
#define   PULSEx_CTRL_PU_ENABLE_DISABLED_Val         _UINT32_(0x0)                             /* (PULSEx_CTRL) Pull-Up disabled */
#define   PULSEx_CTRL_PU_ENABLE_ENABLED_Val          _UINT32_(0x1)                             /* (PULSEx_CTRL) Pull-Up enabled */
#define PULSEx_CTRL_PCx_ENABLE_Pos                 _UINT32_(31)                                /* (PULSEx_CTRL) Output Pulse Enable Position  */
#define PULSEx_CTRL_PCx_ENABLE_Msk                 (_UINT32_(0x1) << PULSEx_CTRL_PCx_ENABLE_Pos)   /* (PULSEx_CTRL) Output Pulse Enable Mask  */
#define PULSEx_CTRL_PCx_ENABLE(value)              (PULSEx_CTRL_PCx_ENABLE_Msk & (_UINT32_(value) << PULSEx_CTRL_PCx_ENABLE_Pos))
#define   PULSEx_CTRL_PCx_ENABLE_DISABLED_Val        _UINT32_(0x0)                             /* (PULSEx_CTRL) Pulse output disabled, inactive level determined by PULSE_POLARITY */
#define   PULSEx_CTRL_PCx_ENABLE_ENABLED_Val         _UINT32_(0x1)                             /* (PULSEx_CTRL) Pulse output enabled */

/* -------- PULSE_CONTRIBUTION_PW : (MET_CONTROL) (R/W 32) Pulse Contribution Power Register -------- */
#define PULSE_CONTRIBUTION_PW_Pos                       _UINT32_(0)                               /* (PULSE_CONTRIBUTION_PW) Enable Power x for pulse computation Position */
#define PULSE_CONTRIBUTION_PW_Msk                       (_UINT32_(0x1) << PULSE_CONTRIBUTION_PW_Pos)    /* (PULSE_CONTRIBUTION_PW) Enable Power x for pulse computation Mask */
#define PULSE_CONTRIBUTION_PW_VALUE(psource, value)     ((PULSE_CONTRIBUTION_PW_Msk & (_UINT32_(value) << PULSE_CONTRIBUTION_PW_Pos)) << psource)
#define   PULSE_CONTRIBUTION_PW_DISABLED_Val              _UINT32_(0x0)                             /* (PULSE_CONTRIBUTION_PW) Disable power */
#define   PULSE_CONTRIBUTION_PW_ENABLED_Val               _UINT32_(0x1)                             /* (PULSE_CONTRIBUTION_PW) Enable power */

/* -------- PULSE_CONTRIBUTION_I : (MET_CONTROL) (R/W 32) Pulse Contribution Power Register -------- */
#define PULSE_CONTRIBUTION_I_Pos                       _UINT32_(0)                               /* (PULSE_CONTRIBUTION_I) Enable current x for pulse computation Position */
#define PULSE_CONTRIBUTION_I_Msk                       (_UINT32_(0x1) << PULSE_CONTRIBUTION_I_Pos)    /* (PULSE_CONTRIBUTION_I) Enable current x for pulse computation Mask */
#define PULSE_CONTRIBUTION_I_VALUE(psource, value)     ((PULSE_CONTRIBUTION_I_Msk & (_UINT32_(value) << PULSE_CONTRIBUTION_I_Pos)) << psource)
#define   PULSE_CONTRIBUTION_I_DISABLED_Val               _UINT32_(0x0)                             /* (PULSE_CONTRIBUTION_I) Disable current */
#define   PULSE_CONTRIBUTION_I_ENABLED_Val                _UINT32_(0x1)                             /* (PULSE_CONTRIBUTION_I) Enable current */

/* -------- P_POWER_OFFSET_CTRL : (MET_CONTROL) (R/W 32) Active Power Offset Control Register -------- */
#define P_POWER_OFFSET_CTRL_ACC_PWx_Pos                       _UINT32_(0)                               /* (P_POWER_OFFSET_CTRL) Active Power Offset for Accumulator Quantities Enable Position */
#define P_POWER_OFFSET_CTRL_ACC_PWx_Msk                       (_UINT32_(0x1) << P_POWER_OFFSET_CTRL_ACC_PWx_Pos)    /* (P_POWER_OFFSET_CTRL) Active Power Offset for Accumulator Quantities Enable Mask */
#define P_POWER_OFFSET_CTRL_ACC_PWx(psource, value)           ((P_POWER_OFFSET_CTRL_ACC_PWx_Msk & (_UINT32_(value) << P_POWER_OFFSET_CTRL_ACC_PWx_Pos)) << psource)
#define   P_POWER_OFFSET_CTRL_ACC_PWx_DISABLED_Val               _UINT32_(0x0)                             /* (P_POWER_OFFSET_CTRL) Disable offset */
#define   P_POWER_OFFSET_CTRL_ACC_PWx_ENABLED_Val                _UINT32_(0x1)                             /* (P_POWER_OFFSET_CTRL) Enable offset */
#define P_POWER_OFFSET_CTRL_PUL_Pos                           _UINT32_(31)                               /* (P_POWER_OFFSET_CTRL) Active Power Offset for Pulse Quantities Enable Position */
#define P_POWER_OFFSET_CTRL_PUL_Msk                           (_UINT32_(0x1) << P_POWER_OFFSET_CTRL_PUL_Pos)    /* (P_POWER_OFFSET_CTRL) Active Power Offset for Pulse Quantities Enable Mask */
#define P_POWER_OFFSET_CTRL_PUL(value)                        (P_POWER_OFFSET_CTRL_PUL_Msk & (_UINT32_(value) << P_POWER_OFFSET_CTRL_PUL_Pos))
#define   P_POWER_OFFSET_CTRL_PUL_DISABLED_Val                   _UINT32_(0x0)                             /* (P_POWER_OFFSET_CTRL) Disable offset */
#define   P_POWER_OFFSET_CTRL_PUL_ENABLED_Val                    _UINT32_(0x1)                             /* (P_POWER_OFFSET_CTRL) Enable offset */

/* -------- Q_POWER_OFFSET_CTRL : (MET_CONTROL) (R/W 32) Active Power Offset Control Register -------- */
#define Q_POWER_OFFSET_CTRL_ACC_PWx_Pos                       _UINT32_(0)                               /* (Q_POWER_OFFSET_CTRL) Reactive Power Offset for Accumulator Quantities Enable Position */
#define Q_POWER_OFFSET_CTRL_ACC_PWx_Msk                       (_UINT32_(0x1) << Q_POWER_OFFSET_CTRL_ACC_PWx_Pos)    /* (Q_POWER_OFFSET_CTRL) Reactive Power Offset for Accumulator Quantities Enable Mask */
#define Q_POWER_OFFSET_CTRL_ACC_PWx(psource, value)           ((Q_POWER_OFFSET_CTRL_ACC_PWx_Msk & (_UINT32_(value) << Q_POWER_OFFSET_CTRL_ACC_PWx_Pos)) << psource)
#define   Q_POWER_OFFSET_CTRL_ACC_PWx_DISABLED_Val               _UINT32_(0x0)                             /* (Q_POWER_OFFSET_CTRL) Disable offset */
#define   Q_POWER_OFFSET_CTRL_ACC_PWx_ENABLED_Val                _UINT32_(0x1)                             /* (Q_POWER_OFFSET_CTRL) Enable offset */
#define Q_POWER_OFFSET_CTRL_PUL_Pos                           _UINT32_(31)                               /* (Q_POWER_OFFSET_CTRL) Reactive Power Offset for Pulse Quantities Enable Position */
#define Q_POWER_OFFSET_CTRL_PUL_Msk                           (_UINT32_(0x1) << Q_POWER_OFFSET_CTRL_PUL_Pos)    /* (Q_POWER_OFFSET_CTRL) Reactive Power Offset for Pulse Quantities Enable Mask */
#define Q_POWER_OFFSET_CTRL_PUL(value)                        (Q_POWER_OFFSET_CTRL_PUL_Msk & (_UINT32_(value) << Q_POWER_OFFSET_CTRL_PUL_Pos))
#define   Q_POWER_OFFSET_CTRL_PUL_DISABLED_Val                   _UINT32_(0x0)                             /* (Q_POWER_OFFSET_CTRL) Disable offset */
#define   Q_POWER_OFFSET_CTRL_PUL_ENABLED_Val                    _UINT32_(0x1)                             /* (Q_POWER_OFFSET_CTRL) Enable offset */

/* -------- CAPTURE_SH_SEL : (MET_CONTROL) (R/W 32) Waveform Capture Channel Selection Register -------- */
#define CAPTURE_SH_SEL_Pos                       _UINT32_(0)                              /* (CAPTURE_SH_SEL) Capture Channel x Select Position */
#define CAPTURE_SH_SEL_Msk                       (_UINT32_(0x1) << CAPTURE_SH_SEL_Pos)    /* (CAPTURE_SH_SEL) Capture Channel x Select Mask */
#define CAPTURE_SH_SEL_VALUE(channel, value)     ((CAPTURE_SH_SEL_Msk & (_UINT32_(value) << CAPTURE_SH_SEL_Pos)) << channel)
#define   CAPTURE_SH_SEL_DISABLED_Val               _UINT32_(0x0)                             /* (CAPTURE_SH_SEL) Waveform capture is disabled for channel x */
#define   CAPTURE_SH_SEL_ENABLED_Val                _UINT32_(0x1)                             /* (CAPTURE_SH_SEL) Waveform capture is enabled for channel x */

/* -------- MCP391x_GAIN : (MET_CONTROL) (R/W 32) MCP391x Gain Control Register -------- */
#define MCP391x_GAIN_PGA_CHx_Pos                       _UINT32_(0)                              /* (MCP391x_GAIN) PGA setting for channel n Position */
#define MCP391x_GAIN_PGA_CHx_Msk                       (_UINT32_(0x7) << MCP391x_GAIN_PGA_CHx_Pos)    /* (MCP391x_GAIN) PGA setting for channel n Mask */
#define MCP391x_GAIN_PGA_CHx(channel, value)           ((MCP391x_GAIN_PGA_CHx_Msk & (_UINT32_(value) << MCP391x_GAIN_PGA_CHx_Pos)) << (3 * channel))
#define   MCP391x_GAIN_PGA_CHx_GAIN1_Val                 _UINT32_(0x0)                           /* (MCP391x_GAIN) Gain is 1 */
#define   MCP391x_GAIN_PGA_CHx_GAIN2_Val                 _UINT32_(0x1)                           /* (MCP391x_GAIN) Gain is 2 */
#define   MCP391x_GAIN_PGA_CHx_GAIN4_Val                 _UINT32_(0x2)                           /* (MCP391x_GAIN) Gain is 4 */
#define   MCP391x_GAIN_PGA_CHx_GAIN8_Val                 _UINT32_(0x3)                           /* (MCP391x_GAIN) Gain is 8 */
#define   MCP391x_GAIN_PGA_CHx_GAIN16_Val                _UINT32_(0x4)                           /* (MCP391x_GAIN) Gain is 16 */
#define   MCP391x_GAIN_PGA_CHx_GAIN22_Val                _UINT32_(0x5)                           /* (MCP391x_GAIN) Gain is 32 */

