Microchip-MPLAB-Harmony/smartenergy_metrology/apps/muti_channel_demo_freertos/src/config/multichannel_demo_pic32cxmtc_db/driver/mcmetrology/drv_mcmetrology_regs.h
/* -------- MCP391x_CONFIG : (MET_CONTROL) (R/W 32) MCP391x Control Register -------- */
#define MCP391x_CONFIG_DITHER_Pos                       _UINT32_(20)                            /* (MCP391x_CONFIG) Dithering circuit for Idle Tone's cancellation Position */
#define MCP391x_CONFIG_DITHER_Msk                       (_UINT32_(0x3) << MCP391x_CONFIG_DITHER_Pos)    /* (MCP391x_CONFIG) Dithering circuit for Idle Tone's cancellation Mask */
#define MCP391x_CONFIG_DITHER(value)                    (MCP391x_CONFIG_DITHER_Msk & (_UINT32_(value) << MCP391x_CONFIG_DITHER_Pos))
#define   MCP391x_CONFIG_DITHER_OFF_Val                   _UINT32_(0x0)                           /* (MCP391x_CONFIG) Dithering off */
#define   MCP391x_CONFIG_DITHER_ON_MIN_Val                _UINT32_(0x1)                           /* (MCP391x_CONFIG) Dithering on, Strength Minimum */
#define   MCP391x_CONFIG_DITHER_ON_MED_Val                _UINT32_(0x2)                           /* (MCP391x_CONFIG) Dithering on, Strength Medium */
#define   MCP391x_CONFIG_DITHER_ON_MAX_Val                _UINT32_(0x3)                           /* (MCP391x_CONFIG) Dithering on, Strength Maximum */
#define MCP391x_CONFIG_BOOST_Pos                       _UINT32_(20)                             /* (MCP391x_CONFIG) BIAS current selection for all ADCs Position */
#define MCP391x_CONFIG_BOOST_Msk                       (_UINT32_(0x3) << MCP391x_CONFIG_BOOST_Pos)    /* (MCP391x_CONFIG) BIAS current selection for all ADCs Mask */
#define MCP391x_CONFIG_BOOST(value)                    (MCP391x_CONFIG_BOOST_Msk & (_UINT32_(value) << MCP391x_CONFIG_BOOST_Pos))
#define   MCP391x_CONFIG_BOOST_x05_Val                  _UINT32_(0x0)                             /* (MCP391x_CONFIG) All channels have current x0.5 */
#define   MCP391x_CONFIG_BOOST_x066_Val                 _UINT32_(0x1)                             /* (MCP391x_CONFIG) All channels have current x0.66 */
#define   MCP391x_CONFIG_BOOST_x1_Val                   _UINT32_(0x2)                             /* (MCP391x_CONFIG) All channels have current x1 */
#define   MCP391x_CONFIG_BOOST_x2_Val                   _UINT32_(0x3)                             /* (MCP391x_CONFIG) All channels have current x2 */

/* -------- VERSION : (MET_STATUS) (R/W 32) Metrology Version -------- */
#define VERSION_FIRMWARE_REV_Pos                    _UINT32_(0)                                 /* (VERSION) Firmware Revision Position */
#define VERSION_FIRMWARE_REV_Msk                    (_UINT32_(0xFF) << VERSION_FIRMWARE_REV_Pos)      /* (VERSION) Firmware Revision Mask */
#define VERSION_FIRMWARE_REV(value)                 (VERSION_FIRMWARE_REV_Msk & (_UINT32_(value) << VERSION_FIRMWARE_REV_Pos))
#define VERSION_FIRMWARE_MINOR_REV_Pos              _UINT32_(8)                                 /* (VERSION) Minor Firmware Revision Position */
#define VERSION_FIRMWARE_MINOR_REV_Msk              (_UINT32_(0xFF) << VERSION_FIRMWARE_MINOR_REV_Pos)      /* (VERSION) Minor Firmware Revision Mask */
#define VERSION_FIRMWARE_MINOR_REV(value)           (VERSION_FIRMWARE_MINOR_REV_Msk & (_UINT32_(value) << VERSION_FIRMWARE_MINOR_REV_Pos))
#define VERSION_FIRMWARE_MAJOR_REV_Pos              _UINT32_(8)                                 /* (VERSION) Major  Firmware Revision Position */
#define VERSION_FIRMWARE_MAJOR_REV_Msk              (_UINT32_(0xFF) << VERSION_FIRMWARE_MAJOR_REV_Pos)      /* (VERSION) Major  Firmware Revision Mask */
#define VERSION_FIRMWARE_MAJOR_REV(value)           (VERSION_FIRMWARE_MAJOR_REV_Msk & (_UINT32_(value) << VERSION_FIRMWARE_MAJOR_REV_Pos))

/* -------- STATUS : (MET_STATUS) (R/W 32) Metrology status -------- */
#define STATUS_STATUS_Pos                           _UINT32_(0)                       /* (STATUS) Metrology status Position */
#define STATUS_STATUS_Msk                           (_UINT32_(0x0F) << STATUS_STATUS_Pos)      /* (STATUS) Metrology status Mask */
#define STATUS_STATUS(value)                        (STATUS_STATUS_Msk & (_UINT32_(value) << STATUS_STATUS_Pos))
#define   STATUS_STATUS_HALT                        _UINT32_(0x0)                   /* (STATUS) Metrology module is halted */
#define   STATUS_STATUS_RESET                       _UINT32_(0x1)                   /* (STATUS) Resetting metrology module */
#define   STATUS_STATUS_INIT_DSP                    _UINT32_(0x2)                   /* (STATUS) Initializing DSP filters */
#define   STATUS_STATUS_DSP_READY                   _UINT32_(0x3)                   /* (STATUS) DSP filters have been initialized */
#define   STATUS_STATUS_INIT_ATSENSE                _UINT32_(0x4)                   /* (STATUS) Initializing ATSENSE */
#define   STATUS_STATUS_ATSENSE_READY               _UINT32_(0x5)                   /* (STATUS) ATSENSE has been initialized */
#define   STATUS_STATUS_READY                       _UINT32_(0x6)                   /* (STATUS) ATSENSE temperature configuration & calibration data has been copied into output registers */
#define   STATUS_STATUS_DSP_SETTLING                _UINT32_(0x7)                   /* (STATUS) Waiting for DSP filters to stabilize to full accuracy */
#define   STATUS_STATUS_DSP_RUNNING                 _UINT32_(0x8)                   /* (STATUS) DSP filters have stabilized to full accuracy */

/* -------- STATUS : (MET_STATUS) (R/W 32) Metrology state flags -------- */
#define STATUS_STATE_FLAG_TIMING_Vx_Pos             _UINT32_(0)                       /* (STATUS) Active Voltage Channel Position */
#define STATUS_STATE_FLAG_TIMING_Vx_Msk             (_UINT32_(0x01F) << STATUS_STATE_FLAG_TIMING_Vx_Pos)      /* (STATUS) Active Voltage Channel Mask */
#define STATUS_STATE_FLAG_TIMING_Vx(value)          (STATUS_STATE_FLAG_TIMING_Vx_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_TIMING_Vx_Pos))
#define   STATUS_STATE_FLAG_TIMING_Vx_A_Val           _UINT32_(0x0)                   /* (STATUS) Voltage phase VA is used for timing extraction purposes  */
#define   STATUS_STATE_FLAG_TIMING_Vx_B_Val           _UINT32_(0x1)                   /* (STATUS) Voltage phase VB is used for timing extraction purposes */
#define   STATUS_STATE_FLAG_TIMING_Vx_C_Val           _UINT32_(0x2)                   /* (STATUS) Voltage phase VC is used for timing extraction purposes */
#define STATUS_STATE_FLAG_FREQ_LOCKED_Pos           _UINT32_(5)                       /* (STATUS) Frequency Locked Flag Position */
#define STATUS_STATE_FLAG_FREQ_LOCKED_Msk           (_UINT32_(0x01) << STATUS_STATE_FLAG_FREQ_LOCKED_Pos)      /* (STATUS) Frequency Locked Flag Mask */
#define STATUS_STATE_FLAG_FREQ_LOCKED(value)        (STATUS_STATE_FLAG_FREQ_LOCKED_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_FREQ_LOCKED_Pos))
#define   STATUS_STATE_FLAG_FREQ_LOCKED_DISABLED_Val   _UINT32_(0x0)                   /* (STATUS) Line frequency is not determined  */
#define   STATUS_STATE_FLAG_FREQ_LOCKED_ENABLED_Val    _UINT32_(0x1)                   /* (STATUS) Line frequency has been determined */
#define STATUS_STATE_FLAG_AFE_FAIL_Pos              _UINT32_(7)                       /* (STATUS) ATSENSE state Position */
#define STATUS_STATE_FLAG_AFE_FAIL_Msk              (_UINT32_(0x01) << STATUS_STATE_FLAG_AFE_FAIL_Pos)      /* (STATUS) ATSENSE state Mask */
#define STATUS_STATE_FLAG_AFE_FAIL(value)           (STATUS_STATE_FLAG_AFE_FAIL_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_AFE_FAIL_Pos))
#define   STATUS_STATE_FLAG_AFE_FAIL_DISABLED_Val      _UINT32_(0x0)                   /* (STATUS) ATSENSE initialization is successful  */
#define   STATUS_STATE_FLAG_AFE_FAIL_ENABLED_Val       _UINT32_(0x1)                   /* (STATUS) ATSENSE initialization is failed */
#define STATUS_STATE_FLAG_HARMONIC_M_CFG_Pos            _UINT32_(9)                                /* (FEATURE_CTRL1) Enable Harmonic Analysis Position */
#define STATUS_STATE_FLAG_HARMONIC_M_CFG_Msk            (_UINT32_(0x7F) << STATUS_STATE_FLAG_HARMONIC_M_CFG_Pos)    /* (FEATURE_CTRL1) Enable Harmonic Analysis Mask */
#define STATUS_STATE_FLAG_HARMONIC_M_CFG(value)         (STATUS_STATE_FLAG_HARMONIC_M_CFG_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_HARMONIC_M_CFG_Pos))
#define STATUS_STATE_FLAG_HOST_ID_FAIL_Pos           _UINT32_(15)                       /* (STATUS) Host Identification Failure Indication Position */
#define STATUS_STATE_FLAG_HOST_ID_FAIL_Msk           (_UINT32_(0x01) << STATUS_STATE_FLAG_HOST_ID_FAIL_Pos)      /* (STATUS) Host Identification Failure Indication Mask */
#define STATUS_STATE_FLAG_HOST_ID_FAIL(value)        (STATUS_STATE_FLAG_HOST_ID_FAIL_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_HOST_ID_FAIL_Pos))
#define   STATUS_STATE_FLAG_HOST_ID_FAIL_SUCCESS_Val   _UINT32_(0x0)                   /* (STATUS) Proper PIC32CXMTx part successfully identified  */
#define   STATUS_STATE_FLAG_HOST_ID_FAIL_FAIL_Val      _UINT32_(0x1)                   /* (STATUS) Failed to identify proper PIC32CXMTx part */
#define STATUS_STATE_FLAG_CREEP_DET_Q_Pos            _UINT32_(19)                       /* (STATUS) Total Reactive Power Creep Detected Flag Position */
#define STATUS_STATE_FLAG_CREEP_DET_Q_Msk            (_UINT32_(0x01) << STATUS_STATE_FLAG_CREEP_DET_Q_Pos)      /* (STATUS) Total Reactive Power Creep Detected Flag Mask */
#define STATUS_STATE_FLAG_CREEP_DET_Q(value)         (STATUS_STATE_FLAG_CREEP_DET_Q_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_CREEP_DET_Q_Pos))
#define   STATUS_STATE_FLAG_CREEP_DET_Q_NO_DETECT_Val   _UINT32_(0x0)                   /* (STATUS) Reactive power creep isn?t detected in the current full line cycle  */
#define   STATUS_STATE_FLAG_CREEP_DET_Q_DETECT_Val      _UINT32_(0x1)                   /* (STATUS) Reactive power creep is detected in the current full line cycle */
#define STATUS_STATE_FLAG_CREEP_DET_P_Pos            _UINT32_(20)                       /* (STATUS) Total Active Power Creep Detected Flag Position */
#define STATUS_STATE_FLAG_CREEP_DET_P_Msk            (_UINT32_(0x01) << STATUS_STATE_FLAG_CREEP_DET_P_Pos)      /* (STATUS) Total Active Power Creep Detected Flag Mask */
#define STATUS_STATE_FLAG_CREEP_DET_P(value)         (STATUS_STATE_FLAG_CREEP_DET_P_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_CREEP_DET_P_Pos))
#define   STATUS_STATE_FLAG_CREEP_DET_P_NO_DETECT_Val   _UINT32_(0x0)                   /* (STATUS) Active power creep isn?t detected in the current full line cycle  */
#define   STATUS_STATE_FLAG_CREEP_DET_P_DETECT_Val      _UINT32_(0x1)                   /* (STATUS) Active power creep is detected in the current full line cycle */
#define STATUS_STATE_FLAG_ARCH_DETECT_FAIL_Pos            _UINT32_(21)                       /* (STATUS) Architecture Detect Failure Position */
#define STATUS_STATE_FLAG_ARCH_DETECT_FAIL_Msk            (_UINT32_(0x01) << STATUS_STATE_FLAG_ARCH_DETECT_FAIL_Pos)      /* (STATUS) Architecture Detect Failure Mask */
#define STATUS_STATE_FLAG_ARCH_DETECT_FAIL(value)         (STATUS_STATE_FLAG_ARCH_DETECT_FAIL_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_ARCH_DETECT_FAIL_Pos))
#define   STATUS_STATE_FLAG_ARCH_DETECT_FAIL_NO_FAIL_Val     _UINT32_(0x0)                   /* (STATUS) A proper device (?SH? or ?C?) was detected  */
#define   STATUS_STATE_FLAG_ARCH_DETECT_FAIL_FAIL_Val        _UINT32_(0x1)                   /* (STATUS) An improper device (not ?SH? nor ?C?) was detected */
#define STATUS_STATE_FLAG_PC_OUT_OF_RANGE_Pos            _UINT32_(22)                       /* (STATUS) Phase Corrector Out of Range Position */
#define STATUS_STATE_FLAG_PC_OUT_OF_RANGE_Msk            (_UINT32_(0x01) << STATUS_STATE_FLAG_PC_OUT_OF_RANGE_Pos)      /* (STATUS) Phase Corrector Out of Range Mask */
#define STATUS_STATE_FLAG_PC_OUT_OF_RANGE(value)         (STATUS_STATE_FLAG_PC_OUT_OF_RANGE_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_PC_OUT_OF_RANGE_Pos))
#define   STATUS_STATE_FLAG_PC_OUT_OF_RANGE_IN_Val         _UINT32_(0x0)                   /* (STATUS) Requested phase correction values in range  */
#define   STATUS_STATE_FLAG_PC_OUT_OF_RANGE_OUT_Val        _UINT32_(0x1)                   /* (STATUS) Requested phase correction values out of range */

/* -------- SWELL_OVERCURRENT_FLAG : (MET_STATUS) (R/W 32) Waveform Capture Channel Selection Register -------- */
#define SWELL_OVERCURRENT_FLAG_Pos                       _UINT32_(0)                       /* (SWELL_OVERCURRENT_FLAG) Voltage Swell (for voltage channels) or Overcurrent (for current channels) Detected Flag for Channel x. Position */
#define SWELL_OVERCURRENT_FLAG_Msk                       (_UINT32_(0x1) << SWELL_OVERCURRENT_FLAG_Pos)    /* (SWELL_OVERCURRENT_FLAG) Voltage Swell (for voltage channels) or Overcurrent (for current channels) Detected Flag for Channel x. Mask */
#define SWELL_OVERCURRENT_FLAG_VALUE(channel, value)     ((SWELL_OVERCURRENT_FLAG_Msk & (_UINT32_(value) << SWELL_OVERCURRENT_FLAG_Pos)) << channel)
#define   SWELL_OVERCURRENT_FLAG_DISABLED_Val               _UINT32_(0x0)                             /* (SWELL_OVERCURRENT_FLAG) Voltage swell or overcurrent is not detected for the current half line cycle */
#define   SWELL_OVERCURRENT_FLAG_ENABLED_Val                _UINT32_(0x1)                             /* (SWELL_OVERCURRENT_FLAG) Voltage swell or overcurrent is detected for the current half line cycle */

/* -------- SAG_FLAG : (MET_STATUS) (R/W 32) Waveform Capture Channel Selection Register -------- */
#define SAG_FLAG_Pos                                    _UINT32_(0)                        /* (SAG_FLAG) Voltage Sag Detected Flag for Channel x Position */
#define SAG_FLAG_Msk                                    (_UINT32_(0x1) << SAG_FLAG_Pos)    /* (SAG_FLAG) Voltage Sag Detected Flag for Channel x Mask */
#define SAG_FLAG_VALUE(channel, value)                  ((SAG_FLAG_Msk & (_UINT32_(value) << SAG_FLAG_Pos)) << channel)
#define   SAG_FLAG_DISABLED_Val                            _UINT32_(0x0)                             /* (SAG_FLAG) Voltage sag is not detected for the current half line cycle */
#define   SAG_FLAG_ENABLED_Val                             _UINT32_(0x1)                             /* (SAG_FLAG) Voltage sag is detected for the current half line cycle */

/* -------- CREEP_FLAG : (MET_STATUS) (R/W 32) Waveform Capture Channel Selection Register -------- */
#define CREEP_FLAG_Pos                                    _UINT32_(0)                          /* (CREEP_FLAG) Channel x Current Creep Detected Position */
#define CREEP_FLAG_Msk                                    (_UINT32_(0x1) << CREEP_FLAG_Pos)    /* (CREEP_FLAG) Channel x Current Creep Detected Mask */
#define CREEP_FLAG_VALUE(channel, value)                  ((CREEP_FLAG_Msk & (_UINT32_(value) << CREEP_FLAG_Pos)) << channel)
#define   CREEP_FLAG_DISABLED_Val                            _UINT32_(0x0)                             /* (CREEP_FLAG) Channel x current creep is not detected in the current full line cycle */
#define   CREEP_FLAG_ENABLED_Val                             _UINT32_(0x1)                             /* (CREEP_FLAG) Channel x current creep is detected in the current full line cycle */

/* -------- PH_ACTIVE_FLAG : (MET_STATUS) (R/W 32) Waveform Capture Channel Selection Register -------- */
#define PH_ACTIVE_FLAG_Pos                                _UINT32_(0)                          /* (PH_ACTIVE_FLAG) Phase x is active Position */
#define PH_ACTIVE_FLAG_Msk                                (_UINT32_(0x1) << PH_ACTIVE_FLAG_Pos)    /* (PH_ACTIVE_FLAG) Phase x is active Mask */
#define PH_ACTIVE_FLAG_VALUE(psource, value)              ((PH_ACTIVE_FLAG_Msk & (_UINT32_(value) << PH_ACTIVE_FLAG_Pos)) << chpsourceannel)
#define   PH_ACTIVE_FLAG_DISABLED_Val                        _UINT32_(0x0)                             /* (PH_ACTIVE_FLAG) Phase x is inactive (the channel x, if configured as voltage, is inactive) */
#define   PH_ACTIVE_FLAG_ENABLED_Val                         _UINT32_(0x1)                             /* (PH_ACTIVE_FLAG) Phase x is active (the channel x, if configured as voltage, is active) */

