Microchip-MPLAB-Harmony/smartenergy_metrology/apps/muti_channel_demo_freertos/src/config/multichannel_demo_pic32cxmtc_db/driver/mcmetrology/drv_mcmetrology_regs.h
/** \brief Metrology Accumulated Output register API structure */
typedef struct
{
    __O  uint64_t CHx[32];               /**< Offset: 0x00  (R/ 64) Amp/Volt-squared-samples, channel x, fundamental + harmonics (uQ24.40) */
    __O  uint64_t CHx_F[32];             /**< Offset: 0x100 (R/ 64) Amp/Volt-squared-samples, channel x, fundamental only (uQ24.40) */
    __O  int64_t  P_CHx[31];             /**< Offset: 0x200 (R/ 64) Watt-samples, power x, fundamental + harmonics (sQ23.40) */
    __O  uint64_t Reserved1;
    __O  int64_t  P_CHx_F[31];           /**< Offset: 0x300 (R/ 64) Watt-samples, power x, fundamental only (sQ23.40) */
    __O  uint64_t Reserved2;
    __O  int64_t  Q_CHx[31];             /**< Offset: 0x400 (R/ 64) VAR-samples, power x, fundamental + harmonics (sQ23.40) */
    __O  uint64_t Reserved3;
    __O  int64_t  Q_CHx_F[31];           /**< Offset: 0x500 (R/ 64) VAR-samples, power x, fundamental only (sQ23.40) */
    __O  uint64_t Reserved4;
    __O  uint64_t V_AB;                  /**< Offset: 0x600 (R/ 32) Volt-square-samples, VA - VB, fundamental + harmonics (uQ24.40) */
    __O  uint64_t V_BC;                  /**< Offset: 0x608 (R/ 32) Volt-square-samples, VB - VC, fundamental + harmonics (uQ24.40) */
    __O  uint64_t V_CA;                  /**< Offset: 0x610 (R/ 32) Volt-square-samples, VC - VA, fundamental + harmonics (uQ24.40) */
    __O  uint64_t V_AB_F;                /**< Offset: 0x618 (R/ 32) Volt-square-samples, VA - VB, fundamental only (uQ24.40) */
    __O  uint64_t V_BC_F;                /**< Offset: 0x620 (R/ 32) Volt-square-samples, VB - VC, fundamental only (uQ24.40) */
    __O  uint64_t V_CA_F;                /**< Offset: 0x628 (R/ 32) Volt-square-samples, VC - VA, fundamental only (uQ24.40) */
    __O  int64_t  ACC_T0;                /**< Offset: 0x630 (R/ 32) Total accumulated quantities specified by PC0_TYPE (sQ33.30) */
    __O  int64_t  ACC_T1;                /**< Offset: 0x638 (R/ 32) Total accumulated quantities specified by PC1_TYPE (sQ33.30) */
    __O  int64_t  ACC_T2;                /**< Offset: 0x640 (R/ 32) Total accumulated quantities specified by PC2_TYPE (sQ33.30) */
    __O  uint64_t Reserved5[15];
} DRV_MCMETROLOGY_REGS_ACCUMULATORS;

/** \brief Metrology Status register API structure */
typedef struct
{
    __O  uint32_t VERSION;                 /**< Offset: 0x00 (R/ 32) Metrology firmware version */
    __O  uint32_t STATUS;                  /**< Offset: 0x04 (R/ 32) Metrology status register */
    __O  uint32_t STATE_FLAG;              /**< Offset: 0x08 (R/ 32) Metrology state flags register */
    __O  uint32_t SWELL_OVERCURRENT_FLAG;  /**< Offset: 0x0C (R/ 32) Metrology state flags register */
    __O  uint32_t SAG_FLAG;                /**< Offset: 0x10 (R/ 32) Sag (voltage channels) flag */             
    __O  uint32_t CREEP_FLAG;              /**< Offset: 0x14 (R/ 32) Creep (current channels) flag */
    __O  uint32_t PH_ACTIVE_FLAG;          /**< Offset: 0x18 (R/ 32) Phase x Active flag */
    __O  uint32_t CAPTURE_STATUS;          /**< Offset: 0x1C (R/ 32) Waveform Capture Function Status */
    __O  uint32_t INTERVAL_NUM;            /**< Offset: 0x20 (R/ 32) Interval number */
    __O  uint32_t N;                       /**< Offset: 0x24 (R/ 32) Number of Samples in the Last Measurement Interval (uQ16.0) */
    __O  uint32_t PH_OFFSET;               /**< Offset: 0x28 (R/ 32) Phase calibration offset (sQ0.31) */
    __O  uint32_t FREQ;                    /**< Offset: 0x2C (R/ 32) Frequency of fundamental harmonic (uQ20.12) */
    __O  uint32_t FREQ_CHx[32];            /**< Offset: 0x30 (R/ 32) Frequency of fundamental harmonic, channel x (uQ20.12) */
    __O  uint32_t Reserved1[2];
    __O  uint32_t CHx_MAX[32];             /**< Offset: 0xB8 (R/ 32) Max current/voltage of channel x during measurement interval (sQ2.29) */
    __O  uint32_t FEATURES;                /**< Offset: 0x138 (R/ 32) Compiled feature indicator */
    __O  uint32_t MPC_CRC_ERRORS;          /**< Offset: 0x13C (R/ 32) CRC errors in the MCP391x MCSPI communication */
    __O  uint32_t Reserved2[2];
    __O  uint32_t PULSE0_COUNTER;          /**< Offset: 0x148 (R/ 32) Counter of Pulse 0 */
    __O  uint32_t PULSE1_COUNTER;          /**< Offset: 0x14C (R/ 32) Counter of Pulse 1 */
    __O  uint32_t PULSE2_COUNTER;          /**< Offset: 0x150 (R/ 32) Counter of Pulse 2 */
    __O  uint32_t Reserved3[2];
    __O  uint32_t ZC_N_CHx[32];            /**< Offset: 0x15C (R/ 32) Zero-crossing sample number of channel x. Just for voltage channels (uQ20.12) */
    __O  uint32_t Reserved4[3];
} DRV_MCMETROLOGY_REGS_STATUS;

/** \brief Metrology Control register API structure */
typedef struct
{
   __IO  uint32_t STATE_CTRL;                           /**< Offset: 0x00 (R/W 32) Metrology state control register */
   __IO  uint32_t FEATURE_CTRL0;                        /**< Offset: 0x04 (R/W 32) Metrology feature setting register */
   __IO  uint32_t FEATURE_CTRL1;                        /**< Offset: 0x08 (R/W 32) Metrology feature setting register */
   __IO  uint32_t Reserved1;             
   __IO  uint32_t POWER_SOURCE[16];                     /**< Offset: 0x10 (R/W 32) Metrology feature setting register */
   __IO  uint32_t METER_TYPE;                           /**< Offset: 0x50 (R/W 32) Sensor type and service type settings register */
   __IO  uint32_t SENSOR_TYPE[2];                       /**< Offset: 0x54 (R/W 32) Sensor type selection */
   __IO  uint32_t M;                                    /**< Offset: 0x5C (R/W 32) Number of line cycles for integration period (uQ12.0) */
   __IO  uint32_t N_MAX;                                /**< Offset: 0x60 (R/W 32) Maximum number of samples in an integration period (uQ24.0) */
   __IO  uint32_t PULSE0_CTRL;                          /**< Offset: 0x64 (R/W 32) Pulse 0 control: enable/disable, polarity, quantity type selection */
   __IO  uint32_t PULSE1_CTRL;                          /**< Offset: 0x68 (R/W 32) Pulse 1 control: enable/disable, polarity, quantity type selection */
   __IO  uint32_t PULSE2_CTRL;                          /**< Offset: 0x6C (R/W 32) Pulse 2 control: enable/disable, polarity, quantity type selection */
   __IO  uint32_t Reserved2;             
   __IO  uint32_t PULSE_CONTRIBUTION_PW;                /**< Offset: 0x74 (R/W 32) Selection of power sources contributing to pulse, for pulses configured to pulse P or Q */
   __IO  uint32_t PULSE_CONTRIBUTION_I;                 /**< Offset: 0x78 (R/W 32) Selection of power sources contributing to pulse, for pulses configured to pulse I */
   __IO  uint32_t Reserved3;             
   __IO  uint32_t P_K_t;                                /**< Offset: 0x80 (R/W 32) Meter Active Power Pulse Constant (uQ8.24) */
   __IO  uint32_t Q_K_t;                                /**< Offset: 0x84 (R/W 32) Meter Reactive Power Pulse Constant (uQ8.24) */
   __IO  uint32_t I_K_t;                                /**< Offset: 0x88 (R/W 32) Meter Current Pulse Constant (uQ8.24) */
   __IO  uint32_t CREEP_THRESHOLD_P;                    /**< Offset: 0x8C (R/W 32) Creep Threshold for Active Energy (uQ2.30) */
   __IO  uint32_t CREEP_THRESHOLD_Q;                    /**< Offset: 0x90 (R/W 32) Creep Threshold for Quadergy (uQ2.30) */
   __IO  uint32_t CREEP_THRESHOLD_I;                    /**< Offset: 0x94 (R/W 32) Creep Threshold of Phase Current (uQ12.20) */
   __IO  uint32_t P_POWER_OFFSET_CTRL;                  /**< Offset: 0x98 (R/W 32) Active Power offset control */
   __IO  uint32_t Q_POWER_OFFSET_CTRL;                  /**< Offset: 0x9C (R/W 32) Reactive Power offset control */
   __IO  uint32_t POWER_OFFSET_P;                       /**< Offset: 0xA0 (R/W 32) Active Power Offset (sQ1.30) */
   __IO  uint32_t POWER_OFFSET_Q;                       /**< Offset: 0xA4 (R/W 32) Reactive Power Offset (sQ1.30) */
   __IO  uint32_t SWELL_OVERCURRENT_THRESHOLD_CHx[32];  /**< Offset: 0xA8 (R/W 32) Voltage swells or overcurrent threshold for each half cycle of CHx channel (uQ0.32) */
   __IO  uint32_t SAG_THRESHOLD_CHx[32];                /**< Offset: 0x128 (R/W 32) Voltage sag threshold for each half cycle of CHx voltage (uQ0.32) */
   __IO  uint32_t K_CHx[32];                            /**< Offset: 0x1A8 (R/W 32) ADC input channel conversion factor (I_A(rms)/Vadc(rms) or V_A(rms)/Vadc(rms)) (uQ22.10) */
   __IO  uint32_t CAL_M_CHx[32];                        /**< Offset: 0x228 (R/W 32) Magnitude calibration constant for channel CHx (sQ2.29) */
   __IO  uint32_t CAL_PH_CHx[32];                       /**< Offset: 0x2A8 (R/W 32) Phase calibration constant for channel CHx (sQ0.31) */
   __IO  uint32_t CAPTURE_CTRL;                         /**< Offset: 0x328 (R/W 32) Waveform capture control register */
   __IO  uint32_t CAPTURE_SH_SEL;                       /**< Offset: 0x32C (R/W 32) Waveform capture channel selection */
   __IO  uint32_t CAPTURE_BUFF_SIZE;                    /**< Offset: 0x330 (R/W 32) Waveform capture buffer size */
   __IO  uint32_t CAPTURE_ADDR;                         /**< Offset: 0x334 (R/W 32) Waveform capture buffer address pointer */
   __IO  uint32_t Reserved4[3];
   __IO  uint32_t MCP391x_GAIN[4];                      /**< Offset: 0x344 (R/W 32) MCP391x GAIN register */
   __IO  uint32_t MCP391x_CONFIG[4];                    /**< Offset: 0x354 (R/W 32) MCP391x CONFIG register */
   __IO  uint32_t Reserved5;             
   __IO  uint32_t POWER_OFFSET_P_x[31];                 /**< Offset: 0x368 (R/W 32) Phase-x accumulation active power offset compensation used to eliminate voltage effects at small current (cross talk) (sQ9.40) */
   __IO  uint32_t Reserved6;             
   __IO  uint32_t POWER_OFFSET_Q_x[31];                 /**< Offset: 0x3E8 (R/W 32) Phase-x accumulation reactive power offset compensation used to eliminate voltage effects at small current (cross talk) (sQ9.40) */
   __IO  uint32_t Reserved7;             
} DRV_MCMETROLOGY_REGS_CONTROL;

/** \brief METROLOGY register API structure */
typedef struct
{
    DRV_MCMETROLOGY_REGS_CONTROL       MET_CONTROL;         /**< Offset: 0x0000 (R/W 32) Metrology Control Registers */
    DRV_MCMETROLOGY_REGS_STATUS        MET_STATUS;          /**< Offset: 0x00F4 (R/ 32) Metrology Status Registers */
    DRV_MCMETROLOGY_REGS_ACCUMULATORS  MET_ACCUMULATORS;    /**< Offset: 0x0180 (R/ 32) Metrology Accumulated Output Registers */
    DRV_MCMETROLOGY_REGS_HARMONICS     MET_HARMONICS;       /**< Offset: 0x0338 (R/ 32) Metrology Harmonic Analysis Output Registers */
} MCMET_REGISTERS;

#endif /* MCMMETROLOGY_REGS_H */
